app/controllers/exams_controller.rb

SELECT DISTINCT "exams".* FROM "exams" LIMIT ? OFFSET ?  [["LIMIT", 15], ["OFFSET", 0]]
SELECT COUNT(*) FROM "exams"
---
  def index
    @search = Exam.ransack(params[:q])
    @exams = @search.result(distinct: true).paginate(page: params[:page], per_page: 15)
    @exams_count = Exam.count

INSERT INTO "exams" ("first_name", "middle_name", "last_name", "subject", "date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @exam = Exam.new(exam_params)
    if @exam.valid?
      @exam.save

UPDATE "exams" SET "date" = ?, "updated_at" = ? WHERE "exams"."id" = ?  [["date", "2021-12-20 13:00:00"], ["updated_at", "2022-01-21 16:43:44.759575"], ["id", 1]]
---
  def update
    if @exam.update(exam_params)

DELETE FROM "exams" WHERE "exams"."id" = ?  [["id", 2]]
---
  def destroy
    @exam.destroy

SELECT "exams".* FROM "exams" WHERE "exams"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_student
    @exam = Exam.find(params[:id])