app/controllers/users_controller.rb

  def create
    @user = User.new user_params
    @user.role = 1
    if @user.save
---
INSERT INTO "users" ("email", "name", "password_digest", "role", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def auth
    @user = User.find_by(email: params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "123@123"], ["LIMIT", 1]]